In [4]:
import numpy as np
import pandas as pd

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.autoindent = True

In [24]:
sozluk1 = {"isim" : [ "Ahmet","Mehmet","Zeynep","Atıl"],
           "spor"  : [ "Koşu"," yüzme","koşu","basketbol"],
           "kalori " : [100,200,300,400] 
}

In [25]:
dataframe1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [26]:
sozluk2 = {"isim" : [ "baran","arda","atlas","fatma"],
           "spor"  : [ "Koşu"," yüzme","koşu","basketbol"],
           "kalori " : [200,300,800,400] 
}
dataframe2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [27]:
sozluk3 = {"isim" : [ "cemal","can","benzema","messi"],
           "spor"  : [ "Koşu"," yüzme","badminton","tenis"],
           "kalori " : [200,300,500,250] 
}
dataframe3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [28]:
dataframe1

     isim       spor  kalori
0   Ahmet       Koşu      100
1  Mehmet      yüzme      200
2  Zeynep       koşu      300
3    Atıl  basketbol      400

## concatenation

In [29]:
pd.concat([dataframe1,dataframe2,dataframe3])

       isim       spor  kalori
0     Ahmet       Koşu      100
1    Mehmet      yüzme      200
2    Zeynep       koşu      300
3      Atıl  basketbol      400
4     baran       Koşu      200
5      arda      yüzme      300
6     atlas       koşu      800
7     fatma  basketbol      400
8     cemal       Koşu      200
9       can      yüzme      300
10  benzema  badminton      500
11    messi      tenis      250

## merge

In [31]:
mergeSozluk = { "isim" : [ "Ahment","Aslı","zeynep","atıl"],
                "spor" : [ "Koşu","yüzme","koşu","baskebol"]}

In [32]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk)

In [33]:
mergeDataFrame1

     isim      spor
0  Ahment      Koşu
1    Aslı     yüzme
2  zeynep      koşu
3    atıl  baskebol

In [35]:
mergeSozluk2 = { "isim" : [ "Ahment","Aslı","zeynep","atıl"],
                "kalori" : [ 100,200,300,400]}

In [38]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [39]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on ="isim")

     isim      spor  kalori
0  Ahment      Koşu     100
1    Aslı     yüzme     200
2  zeynep      koşu     300
3    atıl  baskebol     400

In [40]:
 maasSozluk = { "isim" : [ "Atıl","Zeynep","Mehmet","Ahmet"],
               "Departman" : ["Yazılım","Satı","Pazarlama","Yazılım"],
               "Maas" : [200,390,400,500]}

In [41]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [42]:
maasDataFrame

     isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep       Satı   390
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [43]:
maasDataFrame["Departman"].nunique()

3

In [44]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satı', 'Pazarlama'], dtype=object)

In [45]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satı         1
Pazarlama    1
Name: count, dtype: int64

In [48]:
def bruttenNete(maas):
    return maas*0.66

In [49]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    257.4
2    264.0
3    330.0
Name: Maas, dtype: float64

In [50]:
maasDataFrame.isnull()

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [80]:
yeniVeri = { "Karakter Sınıf"  : [ "South Park","South Park","Simpson","Simpson","Simpson"],
             "Karakter İsimleri": ["Cartmen" ,"Kenny","Homer" ,"Bart","Bart"],
            "Karakter Yas": [9,10,20,20,30]}

In [81]:
karaterDF =pd.DataFrame(yeniVeri)

In [86]:
karaterDF

  Karakter Sınıf Karakter İsimleri  Karakter Yas
0     South Park           Cartmen             9
1     South Park             Kenny            10
2        Simpson             Homer            20
3        Simpson              Bart            20
4        Simpson              Bart            30

In [87]:
karaterDF.pivot_table(values= "Karakter Yas", index =["Karakter Sınıf","Karakter İsimleri"])

                                  Karakter Yas
Karakter Sınıf Karakter İsimleri
Simpson        Bart                       25.0
               Homer                      20.0
South Park     Cartmen                     9.0
               Kenny                      10.0

In [91]:
karaterDF.pivot_table(values= "Karakter Yas", index =["Karakter Sınıf","Karakter İsimleri"],aggfunc=np.sum)

C:\Users\baran\AppData\Local\Temp\ipykernel_39592\2491422042.py:1: FutureWarning: The provided callable <function sum at 0x000001AB9E7E16C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karaterDF.pivot_table(values= "Karakter Yas", index =["Karakter Sınıf","Karakter İsimleri"],aggfunc=np.sum)

                                  Karakter Yas
Karakter Sınıf Karakter İsimleri
Simpson        Bart                         50
               Homer                        20
South Park     Cartmen                       9
               Kenny                        10